lectures/vscode/vscode_lecture3.org
#+TITLE: Lecture 3: Git and GitHub
#+SETUPFILE: /Users/jangsookim/Library/CloudStorage/Dropbox/newbiemacs/nbm-user-settings/org-themes/src/readtheorg_inline/readtheorg_inline.theme



* Git and GitHub for VCS and collaboration
** Overview
#+ATTR_REVEAL: :frag (roll-in)
   - Git is a version control system.
   - GitHub is a platform to share codes for collaboration.
   - We will learn how to use Git and GitHub for writing $\mathrm{\LaTeX}$
     collaboratively.
   - We will do so without using "branches" and "pull requests", although these
     are in fact very important concepts in Git and GitHub.
   - In this way you can learn the work flow much more easily.
   - After this lecture, when you feel necessary, you can learn more about Git
     and GitHub in your own.
** Goals
#+ATTR_REVEAL: :frag (roll-in)
   - Version Control: Keep all versions of your tex file.
   - Go back to any version if needed.
   - View the changes in each version.
   - View the differences between your tex file and your collaborators'.
   - You and your collaborators should be able to edit the tex file
     simultaneously.
   - Merge your tex file with your collaborators'.
   # - Limitation: We allow only one time-line (because we don't use branches).
* Preparations
** Installing Git
   - Mac
     - Type the following in your terminal will install Git if you don't have it already.
       : git --version
     - See the instruction [[https://git-scm.com/book/en/v2/Getting-Started-Installing-Git][here]] if it doesn't work.
   - Windows
     - Download "64-bit Git for Windows Setup" (or 32-bit depending on your
        machine) [[https://git-scm.com/download/win][here]].
     - Install Git using default settings.
     - Restart VS Code.
** Configuring Git user name and email
#+ATTR_REVEAL: :frag (roll-in)
    - Before using Git you need to identify yourself by entering this.
      : git config --global user.name "NAME"
      : git config --global user.email "EMAIL"
    - This needs to be done only once.
    - You can check the result using
      : git config --list
** Installing VS Code Extensions
   - We will use the following two extensions.
   - GitLens
   - Git History
   - These extensions have convenient graphic user interface.
** Signing up GitHub
   - Sign up here https://github.com/
* Work flow
** Overview of work flow
*** Setting up Git repositories
#+ATTR_REVEAL: :frag (roll-in)
     - A /Git repository/ is a folder that is tracked by Git. 
     - Git will keep track of all files in a Git repository and its sub-folders.
     - You first need to set up your local and remote repositories.
     - The local repository is an actual folder in your computer.
     - The remote repository is located in the GitHub server.
*** Commit, Push, and Pull
    - Once you set up local and remote repositories, they are identical now.
    - After making some changes in your files, you need to "commit", which will
      tell Git that the files have been changed.
    - Now only your local repository has been update.
    - To update the remote repository, you need to "push".
    - If your collaborators have changed the remote repository, then you first
      need to "pull" in order to make your local repository up-to-date.

** Setting up Git repositories
#+ATTR_REVEAL: :frag (roll-in)
   - There are two ways to create Git repositories.
   - The first one is using already existing GitHub repository.
   - The second one is using your own folder.
   - Every Git repository has a hidden folder named ~.git~.
   - NEVER touch this hidden folder!
*** From already existing GitHub repository (clone)
    - Visit the GitHub repository that you want to make a remote repository.
    - In the Code tap click the green button "Code".
    - Copy the https address.
    - Go to the "Explorer" tap in your VS Code and close everything using "Close
      Folder" in "File" tap.
    - Click "Clone Repository" and enter the https address here.
    - Select the location of your local repository.

