lectures/vscode/vscode_lecture3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-12 Sat 10:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lecture 3: Git and GitHub</title>
<meta name="author" content="Jang Soo Kim" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lecture 3: Git and GitHub</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org64a34fa">1. Git and GitHub for VCS and collaboration</a>
<ul>
<li><a href="#orgcbe3d37">1.1. Overview</a></li>
<li><a href="#org0fe7c7c">1.2. Goals</a></li>
</ul>
</li>
<li><a href="#orge07ae7d">2. Preparations</a>
<ul>
<li><a href="#orgb9f8428">2.1. Installing Git</a></li>
<li><a href="#org722ee0a">2.2. Configuring Git user name and email</a></li>
<li><a href="#orgaebcb50">2.3. Installing VS Code Extensions</a></li>
<li><a href="#orgb0f6b2f">2.4. Signing up GitHub</a></li>
</ul>
</li>
<li><a href="#org4ae4eaf">3. Work flow</a>
<ul>
<li><a href="#org2e6387b">3.1. Overview of work flow</a>
<ul>
<li><a href="#orgad8d625">3.1.1. Setting up Git repositories</a></li>
<li><a href="#org6cb4659">3.1.2. Commit, Push, and Pull</a></li>
</ul>
</li>
<li><a href="#orge1a7f2a">3.2. Setting up Git repositories</a>
<ul>
<li><a href="#org9655d41">3.2.1. From already existing GitHub repository (clone)</a></li>
<li><a href="#orgffa3be3">3.2.2. From a folder in your computer</a></li>
<li><a href="#orgf08d583">3.2.3. Inviting your collaborators or accepting the invitation</a></li>
<li><a href="#org8d9e979">3.2.4. Exercises (Starting from GitHub)</a></li>
</ul>
</li>
<li><a href="#org232a1de">3.3. Commits</a>
<ul>
<li><a href="#org1730895">3.3.1. Making commits using VS Code</a></li>
</ul>
</li>
<li><a href="#org83ad526">3.4. Push and Pull</a>
<ul>
<li><a href="#org595acfb">3.4.1. Exercises (Commit and Push)</a></li>
</ul>
</li>
<li><a href="#org971e82b">3.5. Merge</a>
<ul>
<li><a href="#orgca9e0de">3.5.1. Exercises (Merge)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org28f8df1">4. GitLens and Git History</a>
<ul>
<li><a href="#org1b4940e">4.1. GitLens</a></li>
<li><a href="#orge0c1504">4.2. Git History</a></li>
</ul>
</li>
<li><a href="#org704069a">5. If collaborators don't use GitHub</a></li>
<li><a href="#orgafcbf1d">6. Exercises (solitary)</a>
<ul>
<li><a href="#orgbe3c79c">6.1. Making Git repositories</a></li>
<li><a href="#orgb736f01">6.2. A file from your collaborator</a></li>
<li><a href="#org69a0aeb">6.3. Commit and push</a></li>
</ul>
</li>
<li><a href="#orgf46a95b">7. Exercises (collaborative push-pull game)</a>
<ul>
<li><a href="#org9ee81f8">7.1. Forming a group</a></li>
<li><a href="#org1e831ea">7.2. Making Git repositories</a></li>
<li><a href="#org900c87b">7.3. Goal</a></li>
<li><a href="#org643dd17">7.4. Rules</a></li>
<li><a href="#org5e31357">7.5. Troubleshooting</a></li>
</ul>
</li>
<li><a href="#org11c81b9">8. Branches</a>
<ul>
<li><a href="#org5ff6375">8.1. What is a branch?</a></li>
<li><a href="#org707457d">8.2. Creating branches</a></li>
<li><a href="#org0fdd797">8.3. Merging branches</a></li>
</ul>
</li>
<li><a href="#org3bd8f71">9. Other tips</a>
<ul>
<li><a href="#org7d16138">9.1. Viewing previous PDF files using Git History</a></li>
<li><a href="#orgb568191">9.2. .gitignore file</a></li>
<li><a href="#org053b0dc">9.3. (For Mac) Hold a key to repeat it.</a></li>
<li><a href="#orgeadfca3">9.4. Deleting GitHub repositories</a></li>
<li><a href="#org54337c5">9.5. Creating your own webpage in GitHub</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org64a34fa" class="outline-2">
<h2 id="org64a34fa"><span class="section-number-2">1.</span> Git and GitHub for VCS and collaboration</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcbe3d37" class="outline-3">
<h3 id="orgcbe3d37"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Git is a version control system.</li>
<li>GitHub is a platform to share codes for collaboration.</li>
<li>We will learn how to use Git and GitHub for writing \(\mathrm{\LaTeX}\)
collaboratively.</li>
<li>We will do so without using "branches" and "pull requests", although these
are in fact very important concepts in Git and GitHub.</li>
<li>In this way you can learn the work flow much more easily.</li>
<li>After this lecture, when you feel necessary, you can learn more about Git
and GitHub in your own.</li>
</ul>
</div>
</div>
<div id="outline-container-org0fe7c7c" class="outline-3">
<h3 id="org0fe7c7c"><span class="section-number-3">1.2.</span> Goals</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Version Control: Keep all versions of your tex file.</li>
<li>Go back to any version if needed.</li>
<li>View the changes in each version.</li>
<li>View the differences between your tex file and your collaborators'.</li>
<li>You and your collaborators should be able to edit the tex file
simultaneously.</li>
<li>Merge your tex file with your collaborators'.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge07ae7d" class="outline-2">
<h2 id="orge07ae7d"><span class="section-number-2">2.</span> Preparations</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb9f8428" class="outline-3">
<h3 id="orgb9f8428"><span class="section-number-3">2.1.</span> Installing Git</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Mac
<ul class="org-ul">
<li><p>
Type the following in your terminal will install Git if you don't have it already.
</p>
<pre class="example">
git --version
</pre></li>
<li>See the instruction <a href="https://git-scm.com/book/en/v2/Getting-Started-Installing-Git">here</a> if it doesn't work.</li>
</ul></li>
<li>Windows
<ul class="org-ul">
<li>Download "64-bit Git for Windows Setup" (or 32-bit depending on your
machine) <a href="https://git-scm.com/download/win">here</a>.</li>
<li>Install Git using default settings.</li>
<li>Restart VS Code.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org722ee0a" class="outline-3">
<h3 id="org722ee0a"><span class="section-number-3">2.2.</span> Configuring Git user name and email</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><p>
Before using Git you need to identify yourself by entering this.
</p>
<pre class="example">
git config --global user.name "NAME"
git config --global user.email "EMAIL"
</pre></li>
<li>This needs to be done only once.</li>
<li><p>
You can check the result using
</p>
<pre class="example">
git config --list
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgaebcb50" class="outline-3">
<h3 id="orgaebcb50"><span class="section-number-3">2.3.</span> Installing VS Code Extensions</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>We will use the following two extensions.</li>
<li>GitLens</li>
<li>Git History</li>
<li>These extensions have convenient graphic user interface.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb0f6b2f" class="outline-3">
<h3 id="orgb0f6b2f"><span class="section-number-3">2.4.</span> Signing up GitHub</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Sign up here <a href="https://github.com/">https://github.com/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4ae4eaf" class="outline-2">
<h2 id="org4ae4eaf"><span class="section-number-2">3.</span> Work flow</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2e6387b" class="outline-3">
<h3 id="org2e6387b"><span class="section-number-3">3.1.</span> Overview of work flow</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgad8d625" class="outline-4">
<h4 id="orgad8d625"><span class="section-number-4">3.1.1.</span> Setting up Git repositories</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>A <i>Git repository</i> is a folder that is tracked by Git.</li>
<li>Git will keep track of all files in a Git repository and its sub-folders.</li>
<li>You first need to set up your local and remote repositories.</li>
<li>The local repository is an actual folder in your computer.</li>
<li>The remote repository is located in the GitHub server.</li>
</ul>
</div>
</div>
<div id="outline-container-org6cb4659" class="outline-4">
<h4 id="org6cb4659"><span class="section-number-4">3.1.2.</span> Commit, Push, and Pull</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Once you set up local and remote repositories, they are identical now.</li>
<li>After making some changes in your files, you need to "commit", which will
tell Git that the files have been changed.</li>
<li>Now only your local repository has been update.</li>
<li>To update the remote repository, you need to "push".</li>
<li>If your collaborators have changed the remote repository, then you first
need to "pull" in order to make your local repository up-to-date.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge1a7f2a" class="outline-3">
<h3 id="orge1a7f2a"><span class="section-number-3">3.2.</span> Setting up Git repositories</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>There are two ways to create Git repositories.</li>
<li>The first one is using already existing GitHub repository.</li>
<li>The second one is using your own folder.</li>
<li>Every Git repository has a hidden folder named <code>.git</code>.</li>
<li>NEVER touch this hidden folder!</li>
</ul>
</div>
<div id="outline-container-org9655d41" class="outline-4">
<h4 id="org9655d41"><span class="section-number-4">3.2.1.</span> From already existing GitHub repository (clone)</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>Visit the GitHub repository that you want to make a remote repository.</li>
<li>In the Code tap click the green button "Code".</li>
<li>Copy the https address.</li>
<li>Go to the "Explorer" tap in your VS Code and close everything using "Close
Folder" in "File" tap.</li>
<li>Click "Clone Repository" and enter the https address here.</li>
<li>Select the location of your local repository.</li>
</ul>
</div>
</div>
