lectures/vscode/vscode_lecture3.org
*** From a folder in your computer
     1. Open your folder in VS Code that you want to make a Git repository.
     2. Click the icon "Source Control" on the left.
     3. Click "Publish to GitHub".
     4. Command Palette (CP) will be opened with two options:
        - Publish to GitHub private repository
        - Publish to GitHub public repository
     5. Select "Publish to GitHub private repository" and select only the tex
        file (NOT the pdf file!) and other necessary files to compile the tex
        file.
*** Inviting your collaborators or accepting the invitation
    - If your collaborators created the remote repository, they will invite you
      to the repository.
    - If you created the remote repository, you need to invite them as follows.
    - Login to GitHub and visit the GitHub repository you want to share.
    - Click "Settings" and click "Manage access".
    - Click "Invite a collaborator" and add your collaborator one at a time.
    - Once they accept the invitation they will be able to change the files.

*** Exercises (Starting from GitHub)
#+ATTR_REVEAL: :frag (roll-in)
    1. Login to GitHub.
    2. Create a new repository "Git-practice1".
    3. In the Code tap, click the link "creating a new file" and make a file
       "practice1.txt" with the following content:
       : Git practice 1
    4. Clone this GitHub repository into your local repository.

** Commits
#+ATTR_REVEAL: :frag (roll-in)
   - [[https://git-scm.com/docs/user-manual][Git manual]] defines a /commit/ as a single point in the Git history.
   - We will simply think of a commit as a version of your tex file.
   - A commit has two parts.
     - Move changed files to the staged area.
     - Make a commit with a commit message.
*** Making commits using VS Code
#+ATTR_REVEAL: :frag (roll-in)
     - Click the "Source Control" icon on the left.
     - Each file has a mark.
       - U means the file is untracked by Git.
       - M means the file is modified (and is kept tract of by Git).
       - C means the file has some conflicts.
     - Click the + button on the modified file (marked M).
     - The file will be move to "Staged Changes".
     - Write a commit message in the message box and enter CMD+ENTER.

** Push and Pull
#+ATTR_REVEAL: :frag (roll-in)
   - Push is the command that updates the remote repository with the local repository.
   - Pull is the other way around.
   - To push type "Git: Push" in CP.
   - To pull type "Git: Pull" in CP.
*** Exercises (Commit and Push)
#+ATTR_REVEAL: :frag (roll-in)
    1. Open your local repository "Git-practice1" in VS Code.
    2. Add a new line in the file "practice1.txt".
    3. Commit with commit message "first commit".
    4. Push.
    5. Check the changes in your GitHub repository.
    6. Create a new file "practice2.txt" in your local repository and repeat
       2,3,4,5.
    7. Delete the file "practice2.txt" in VS Code.
    8. Move the deleted file into the staged area and commit and push.
    9. Check the changes in your GitHub repository.
** Merge
#+ATTR_REVEAL: :frag (roll-in)
   - If your local repository is not up-to-date, you have to pull first and then push.
   - If there are no conflicts, Git will automatically merge the two files from
     local and remote repositories.
   - If there are conflicts, you have to merge the two files manually as follows.
     1. Git will write the conflicts in the tex file.
     2. You can simply click the change that you want to keep.
     3. Once you've resolved all conflicts, save the file and the click the + button.
     4. Commit and push.
*** Exercises (Merge)
#+ATTR_REVEAL: :frag (roll-in)
    1. Visit your GitHub repository "Git-practice1".
    2. In the Code tap click the file "practice1.txt".
    3. Add a new line "Added from GitHub" in this file and commit (in GitHub).
    4. Open your local repository "Git-practice1" in VS Code.
    5. Add a new line "Added from VS Code" in this file and commit (in VS Code).
    6. Push. (This will show an error message.)
    7. Pull and merge the changes (accept both changes).
    8. Push and check the changes in GitHub.
* GitLens and Git History
** GitLens
   - GitLens shows who and when the line with cursor was committed.
   - Moving your mouse pointer over this line shows more details.
   - From there you can see the changes when the commit was made.
** Git History
   - Git History shows the history of all commits using a diagram.
   - Enter "Git: View History" in CP.
   - You can investigate each commit by clicking it on the diagram.
   - You can see the file or changes at that commit.
   - In the diagram on the right, 
     - "master" is the current state of your local repository and
     - "origin/master" is the current state of your remote repository.

* If collaborators don't use GitHub 
#+ATTR_REVEAL: :frag (roll-in)
  - You can still do the same thing even if your collaborators do not use GitHub.
  - When you make changes you push as usual.
  - But you have to wait when your collaborators are working on the tex file.
  - Whenever your collaborator sends you their file you need to do as follows.
    1. Replace your tex file with your collaborator's (their filenames must be
       identical).
    2. Commit and push.
    3. Review the changes your collaborator have made.
* Exercises (solitary)
** Making Git repositories
#+ATTR_REVEAL: :frag (roll-in)
   1. Download [[file:git-exercises.zip][this file]] and extract it in your computer.
   2. Drag-and-drop the whole folder (not just the tex file!) into VS Code.
      (Make sure that you have closed all folder in VS Code before opening this
      folder.)
   3. Compile the tex file.
   4. Make this folder a local repository and create a remote repository. (Hint:
      "Publish to GitHub")
   5. Select only the tex file when you do this.
** A file from your collaborator
#+ATTR_REVEAL: :frag (roll-in)
   1. Your collaborator just sent you their tex file. This is in the folder
      "from your collaborator".
   2. Replace your tex file with the file from your collaborator. 
   3. Commit and push.
   4. Review the changes.
   5. Modify the file if you feel necessary.
   6. Commit and push.
