lectures/vscode/vscode_lecture3.html

<div id="outline-container-orgffa3be3" class="outline-4">
<h4 id="orgffa3be3"><span class="section-number-4">3.2.2.</span> From a folder in your computer</h4>
<div class="outline-text-4" id="text-3-2-2">
<ol class="org-ol">
<li>Open your folder in VS Code that you want to make a Git repository.</li>
<li>Click the icon "Source Control" on the left.</li>
<li>Click "Publish to GitHub".</li>
<li>Command Palette (CP) will be opened with two options:
<ul class="org-ul">
<li>Publish to GitHub private repository</li>
<li>Publish to GitHub public repository</li>
</ul></li>
<li>Select "Publish to GitHub private repository" and select only the tex
file (NOT the pdf file!) and other necessary files to compile the tex
file.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf08d583" class="outline-4">
<h4 id="orgf08d583"><span class="section-number-4">3.2.3.</span> Inviting your collaborators or accepting the invitation</h4>
<div class="outline-text-4" id="text-3-2-3">
<ul class="org-ul">
<li>If your collaborators created the remote repository, they will invite you
to the repository.</li>
<li>If you created the remote repository, you need to invite them as follows.</li>
<li>Login to GitHub and visit the GitHub repository you want to share.</li>
<li>Click "Settings" and click "Manage access".</li>
<li>Click "Invite a collaborator" and add your collaborator one at a time.</li>
<li>Once they accept the invitation they will be able to change the files.</li>
</ul>
</div>
</div>

<div id="outline-container-org8d9e979" class="outline-4">
<h4 id="org8d9e979"><span class="section-number-4">3.2.4.</span> Exercises (Starting from GitHub)</h4>
<div class="outline-text-4" id="text-3-2-4">
<ol class="org-ol">
<li>Login to GitHub.</li>
<li>Create a new repository "Git-practice1".</li>
<li><p>
In the Code tap, click the link "creating a new file" and make a file
"practice1.txt" with the following content:
</p>
<pre class="example">
Git practice 1
</pre></li>
<li>Clone this GitHub repository into your local repository.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org232a1de" class="outline-3">
<h3 id="org232a1de"><span class="section-number-3">3.3.</span> Commits</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><a href="https://git-scm.com/docs/user-manual">Git manual</a> defines a <i>commit</i> as a single point in the Git history.</li>
<li>We will simply think of a commit as a version of your tex file.</li>
<li>A commit has two parts.
<ul class="org-ul">
<li>Move changed files to the staged area.</li>
<li>Make a commit with a commit message.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org1730895" class="outline-4">
<h4 id="org1730895"><span class="section-number-4">3.3.1.</span> Making commits using VS Code</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>Click the "Source Control" icon on the left.</li>
<li>Each file has a mark.
<ul class="org-ul">
<li>U means the file is untracked by Git.</li>
<li>M means the file is modified (and is kept tract of by Git).</li>
<li>C means the file has some conflicts.</li>
</ul></li>
<li>Click the + button on the modified file (marked M).</li>
<li>The file will be move to "Staged Changes".</li>
<li>Write a commit message in the message box and enter CMD+ENTER.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org83ad526" class="outline-3">
<h3 id="org83ad526"><span class="section-number-3">3.4.</span> Push and Pull</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Push is the command that updates the remote repository with the local repository.</li>
<li>Pull is the other way around.</li>
<li>To push type "Git: Push" in CP.</li>
<li>To pull type "Git: Pull" in CP.</li>
</ul>
</div>
<div id="outline-container-org595acfb" class="outline-4">
<h4 id="org595acfb"><span class="section-number-4">3.4.1.</span> Exercises (Commit and Push)</h4>
<div class="outline-text-4" id="text-3-4-1">
<ol class="org-ol">
<li>Open your local repository "Git-practice1" in VS Code.</li>
<li>Add a new line in the file "practice1.txt".</li>
<li>Commit with commit message "first commit".</li>
<li>Push.</li>
<li>Check the changes in your GitHub repository.</li>
<li>Create a new file "practice2.txt" in your local repository and repeat
2,3,4,5.</li>
<li>Delete the file "practice2.txt" in VS Code.</li>
<li>Move the deleted file into the staged area and commit and push.</li>
<li>Check the changes in your GitHub repository.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org971e82b" class="outline-3">
<h3 id="org971e82b"><span class="section-number-3">3.5.</span> Merge</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>If your local repository is not up-to-date, you have to pull first and then push.</li>
<li>If there are no conflicts Git will automatically merge the two files from
local and remote repositories.</li>
<li>If there are conflicts, you have to merge the two files manually as follows.
<ol class="org-ol">
<li>Git will write the conflicts in the tex file.</li>
<li>You can simply click the change that you want to keep.</li>
<li>Once you've resolved all conflicts, save the file and the click the + button.</li>
<li>Commit and push.</li>
</ol></li>
</ul>
</div>
<div id="outline-container-orgca9e0de" class="outline-4">
<h4 id="orgca9e0de"><span class="section-number-4">3.5.1.</span> Exercises (Merge)</h4>
<div class="outline-text-4" id="text-3-5-1">
<ol class="org-ol">
<li>Visit your GitHub repository "Git-practice1".</li>
<li>In the Code tap click the file "practice1.txt".</li>
<li>Add a new line "Added from GitHub" in this file and commit (in GitHub).</li>
<li>Open your local repository "Git-practice1" in VS Code.</li>
<li>Add a new line "Added from VS Code" in this file and commit (in VS Code).</li>
<li>Push. (This will show an error message.)</li>
<li>Pull and merge the changes (accept both changes).</li>
<li>Push and check the changes in GitHub.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org28f8df1" class="outline-2">
<h2 id="org28f8df1"><span class="section-number-2">4.</span> GitLens and Git History</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1b4940e" class="outline-3">
<h3 id="org1b4940e"><span class="section-number-3">4.1.</span> GitLens</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>GitLens shows who and when the line with cursor was committed.</li>
<li>Moving your mouse pointer over this line shows more details.</li>
<li>From there you can see the changes when the commit was made.</li>
</ul>
</div>
</div>
<div id="outline-container-orge0c1504" class="outline-3">
<h3 id="orge0c1504"><span class="section-number-3">4.2.</span> Git History</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Git History shows the history of all commits using a diagram.</li>
<li>Enter "Git: View History" in CP.</li>
<li>You can investigate each commit by clicking it on the diagram.</li>
<li>You can see the file or changes at that commit.</li>
<li>In the diagram on the right, 
<ul class="org-ul">
<li>"master" is the current state of your local repository and</li>
<li>"origin/master" is the current state of your remote repository.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org704069a" class="outline-2">
<h2 id="org704069a"><span class="section-number-2">5.</span> If collaborators don't use GitHub</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>You can still do the same thing even if your collaborators do not use GitHub.</li>
<li>When you make changes you push as usual.</li>
<li>But you have to wait when your collaborators are working on the tex file.</li>
<li>Whenever your collaborator sends you their file you need to do as follows.
<ol class="org-ol">
<li>Replace your tex file with your collaborator's (their filenames must be
identical).</li>
<li>Commit and push.</li>
<li>Review the changes your collaborator have made.</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgafcbf1d" class="outline-2">
<h2 id="orgafcbf1d"><span class="section-number-2">6.</span> Exercises (solitary)</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgbe3c79c" class="outline-3">
<h3 id="orgbe3c79c"><span class="section-number-3">6.1.</span> Making Git repositories</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li>Download <a href="git-exercises.zip">this file</a> and extract it in your computer.</li>
<li>Drag-and-drop the whole folder (not just the tex file!) into VS Code.
(Make sure that you have closed all folder in VS Code before opening this
folder.)</li>
<li>Compile the tex file.</li>
<li>Make this folder a local repository and create a remote repository. (Hint:
"Publish to GitHub")</li>
<li>Select only the tex file when you do this.</li>
</ol>
</div>
</div>
<div id="outline-container-orgb736f01" class="outline-3">
<h3 id="orgb736f01"><span class="section-number-3">6.2.</span> A file from your collaborator</h3>
<div class="outline-text-3" id="text-6-2">
<ol class="org-ol">
<li>Your collaborator just sent you their tex file. This is in the folder
"from your collaborator".</li>
<li>Replace your tex file with the file from your collaborator.</li>
<li>Commit and push.</li>
<li>Review the changes.</li>
<li>Modify the file if you feel necessary.</li>
<li>Commit and push.</li>
</ol>
</div>
</div>
