lectures/vscode/vscode_lecture3.org
** Commit and push
#+ATTR_REVEAL: :frag (roll-in)
   1. Write contents in Section 5.
   2. Commit your changes with commit message "Add contents in Section 4" (the
      tex file only).
   3. Push.
   4. Check Git History and see the changes that you just made.
* Exercises (collaborative push-pull game)
** Forming a group
   1. Form a group of at least 3 people.
   2. Choose a leader.
** Making Git repositories
#+ATTR_REVEAL: :frag (roll-in)
   1. The leader creates a new Git repository "Push-Pull-Game" directly from GitHub.
   2. In GitHub the leader creates a new file "Push-Pull-Game.txt" with the following content.
      :  Push-Pull Game
      :  Numbers: 1
      :
      :  1. The leader's name (or nickname)
   3. The leader invites the group members to this repository.
   4. The group members (including the leader) creates a local repository by
      cloning this GitHub repository.
** Goal
#+ATTR_REVEAL: :frag (roll-in)
   - The goal is to update the file so that it looks like
      :  Push-Pull Game
      :  Numbers: 1, 2, 3, 4
      :
      :  1. Name1
      :  2. Name2
      :  3. Name3
      :  4. Name4
   - Everyone tries to add the next number at the end of the second line and add
     his/her name at the end with that number.
   - Everyone must write his/her name (or nickname) exactly 3 times.
** Rules
#+ATTR_REVEAL: :frag (roll-in)
   - If you pushed successively, then you have to wait for 1 minute before you
     try pushing again.
   - You cannot delete anything that's already written in the file.
** Troubleshooting
   - If you are stuck and cannot do either push or pull, you can discard you
     changes by clicking the curvy arrow in "Source Control" sidebar. You can
     then start over.

* Branches 
** What is a branch?
   - [[https://git-scm.com/docs/user-manual][Git manual]] defines /branch/ as follows.
   - A "branch" is an active line of development. The most recent commit on a
     branch is referred to as the tip of that branch. The tip of the branch is
     referenced by a branch head, which moves forward as additional development
     is done on the branch. A single Git repository can track an arbitrary
     number of branches, but your working tree is associated with just one of
     them (the "current" or "checked out" branch), and HEAD points to that
     branch.
** Creating branches
   - You can easily create a branch using Git History.
   - In Git History, click "+Branch" at the commit you want to make a branch from.
   - Enter a branch name.
   - Then an icon with that branch name will appear.
   - Clicking on this icon you can switch to that branch.
** Merging branches
   - To merge the current branch from another branch enter "Git: Merge Branch"
     in CP and then enter the branch you want to merge from.
   - This will automatically merge the two branches.
   - However, if there are some conflicts between the two branches you need to
     resolve the conflicts first.



* Other tips
** Viewing previous PDF files using Git History
   - Enter "Git: View History" in CP.
   - Click the commit that you want to see a pdf.
   - Click "View" icon at the bottom.
   - This will open the tex file when the commit was made.
   - You can build LaTeX and view PDF as usual.

** .gitignore file
   - ~.gitignore~ file tells Git what files to ignore.
   - If you add a file to ~.gitignore~ then Git will no longer track this file.
   - To add a file to ~.gitignore~, right click on that file and click "Add to
     .gitignore".
** (For Mac) Hold a key to repeat it. 
   - If you want to have a key repeated when you hold it, type the following in
     a terminal:
     : defaults write com.microsoft.VSCode ApplePressAndHoldEnabled -bool false
   - You have to restart VS Code.
   - Reference: [[https://stackoverflow.com/questions/39972335/how-do-i-press-and-hold-a-key-and-have-it-repeat-in-vscode][stackoverflow]]
** Deleting GitHub repositories
   - You can delete a GitHub repository in the "Settings" tap.
   - You can simply delete your local repository as usual.
** Creating your own webpage in GitHub
   - You can make your webpage by creating a new repository named
     "username.github.io".
   - See [[https://pages.github.com/][Link]].
