lectures/vscode/vscode_lecture3.html
<div id="outline-container-org69a0aeb" class="outline-3">
<h3 id="org69a0aeb"><span class="section-number-3">6.3.</span> Commit and push</h3>
<div class="outline-text-3" id="text-6-3">
<ol class="org-ol">
<li>Write contents in Section 5.</li>
<li>Commit your changes with commit message "Add contents in Section 4" (the
tex file only).</li>
<li>Push.</li>
<li>Check Git History and see the changes that you just made.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf46a95b" class="outline-2">
<h2 id="orgf46a95b"><span class="section-number-2">7.</span> Exercises (collaborative push-pull game)</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org9ee81f8" class="outline-3">
<h3 id="org9ee81f8"><span class="section-number-3">7.1.</span> Forming a group</h3>
<div class="outline-text-3" id="text-7-1">
<ol class="org-ol">
<li>Form a group of at least 3 people.</li>
<li>Choose a leader.</li>
</ol>
</div>
</div>
<div id="outline-container-org1e831ea" class="outline-3">
<h3 id="org1e831ea"><span class="section-number-3">7.2.</span> Making Git repositories</h3>
<div class="outline-text-3" id="text-7-2">
<ol class="org-ol">
<li>The leader creates a new Git repository "Push-Pull-Game" directly from GitHub.</li>
<li><p>
In GitHub the leader creates a new file "Push-Pull-Game.txt" with the following content.
</p>
<pre class="example">
Push-Pull Game
Numbers: 1

1. The leader's name (or nickname)
</pre></li>
<li>The leader invites the group members to this repository.</li>
<li>The group members (including the leader) creates a local repository by
cloning this GitHub repository.</li>
</ol>
</div>
</div>
<div id="outline-container-org900c87b" class="outline-3">
<h3 id="org900c87b"><span class="section-number-3">7.3.</span> Goal</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li><p>
The goal is to update the file so that it looks like
</p>
<pre class="example">
Push-Pull Game
Numbers: 1, 2, 3, 4

1. Name1
2. Name2
3. Name3
4. Name4
</pre></li>
<li>Everyone tries to add the next number at the end of the second line and add
his/her name at the end with that number.</li>
<li>Everyone must write his/her name (or nickname) exactly 3 times.</li>
</ul>
</div>
</div>
<div id="outline-container-org643dd17" class="outline-3">
<h3 id="org643dd17"><span class="section-number-3">7.4.</span> Rules</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>If you pushed successively, then you have to wait for 1 minute before you
try pushing again.</li>
<li>You cannot delete anything that's already written in the file.</li>
</ul>
</div>
</div>
<div id="outline-container-org5e31357" class="outline-3">
<h3 id="org5e31357"><span class="section-number-3">7.5.</span> Troubleshooting</h3>
<div class="outline-text-3" id="text-7-5">
<ul class="org-ul">
<li>If you are stuck and cannot do either push or pull, you can discard you
changes by clicking the curvy arrow in "Source Control" sidebar. You can
then start over.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org11c81b9" class="outline-2">
<h2 id="org11c81b9"><span class="section-number-2">8.</span> Branches</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org5ff6375" class="outline-3">
<h3 id="org5ff6375"><span class="section-number-3">8.1.</span> What is a branch?</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li><a href="https://git-scm.com/docs/user-manual">Git manual</a> defines <i>branch</i> as follows.</li>
<li>A "branch" is an active line of development. The most recent commit on a
branch is referred to as the tip of that branch. The tip of the branch is
referenced by a branch head, which moves forward as additional development
is done on the branch. A single Git repository can track an arbitrary
number of branches, but your working tree is associated with just one of
them (the "current" or "checked out" branch), and HEAD points to that
branch.</li>
</ul>
</div>
</div>
<div id="outline-container-org707457d" class="outline-3">
<h3 id="org707457d"><span class="section-number-3">8.2.</span> Creating branches</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>You can easily create a branch using Git History.</li>
<li>In Git History, click "+Branch" at the commit you want to make a branch from.</li>
<li>Enter a branch name.</li>
<li>Then an icon with that branch name will appear.</li>
<li>Clicking on this icon you can switch to that branch.</li>
</ul>
</div>
</div>
<div id="outline-container-org0fdd797" class="outline-3">
<h3 id="org0fdd797"><span class="section-number-3">8.3.</span> Merging branches</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>To merge the current branch from another branch enter "Git: Merge Branch"
in CP and then enter the branch you want to merge from.</li>
<li>This will automatically merge the two branches.</li>
<li>However, if there are some conflicts between the two branches you need to
resolve the conflicts first.</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org3bd8f71" class="outline-2">
<h2 id="org3bd8f71"><span class="section-number-2">9.</span> Other tips</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org7d16138" class="outline-3">
<h3 id="org7d16138"><span class="section-number-3">9.1.</span> Viewing previous PDF files using Git History</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Enter "Git: View History" in CP.</li>
<li>Click the commit that you want to see a pdf.</li>
<li>Click "View" icon at the bottom.</li>
<li>This will open the tex file when the commit was made.</li>
<li>You can build LaTeX and view PDF as usual.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb568191" class="outline-3">
<h3 id="orgb568191"><span class="section-number-3">9.2.</span> .gitignore file</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li><code>.gitignore</code> file tells Git what files to ignore.</li>
<li>If you add a file to <code>.gitignore</code> then Git will no longer track this file.</li>
<li>To add a file to <code>.gitignore</code>, right click on that file and click "Add to
.gitignore".</li>
</ul>
</div>
</div>
<div id="outline-container-org053b0dc" class="outline-3">
<h3 id="org053b0dc"><span class="section-number-3">9.3.</span> (For Mac) Hold a key to repeat it.</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li><p>
If you want to have a key repeated when you hold it, type the following in
a terminal:
</p>
<pre class="example">
defaults write com.microsoft.VSCode ApplePressAndHoldEnabled -bool false
</pre></li>
<li>You have to restart VS Code.</li>
<li>Reference: <a href="https://stackoverflow.com/questions/39972335/how-do-i-press-and-hold-a-key-and-have-it-repeat-in-vscode">stackoverflow</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgeadfca3" class="outline-3">
<h3 id="orgeadfca3"><span class="section-number-3">9.4.</span> Deleting GitHub repositories</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li>You can delete a GitHub repository in the "Settings" tap.</li>
<li>You can simply delete your local repository as usual.</li>
</ul>
</div>
</div>
<div id="outline-container-org54337c5" class="outline-3">
<h3 id="org54337c5"><span class="section-number-3">9.5.</span> Creating your own webpage in GitHub</h3>
<div class="outline-text-3" id="text-9-5">
<ul class="org-ul">
<li>You can make your webpage by creating a new repository named
"username.github.io".</li>
<li>See <a href="https://pages.github.com/">Link</a>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jang Soo Kim</p>
<p class="date">Created: 2022-02-12 Sat 10:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
